# Analytical functions

In [150]:
%load_ext sql
%sql oracle+cx_oracle://hr:oracle@srv2.lan:1521/free

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting and switching to connection 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

In [2]:
%%sql
SELECT
   C.region_id, 
   MAX(R.region_name) AS region
   ,LISTAGG(C.country_name, ', ') 
   WITHIN GROUP (ORDER BY C.country_name) AS LIST
FROM countries C 
LEFT JOIN regions R ON C.region_id = R.region_id  
GROUP BY C.region_id

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-----------+----------+--------------------------------------------------------------------------------------------------------------------------+
| region_id |  region  |                                                           list                                                           |
+-----------+----------+--------------------------------------------------------------------------------------------------------------------------+
|     10    |  Europe  | Belgium, Denmark, France, Germany, Italy, Netherlands, Switzerland, United Kingdom of Great Britain and Northern Ireland |
|     20    | Americas |                               Argentina, Brazil, Canada, Mexico, United States of America                                |
|     30    |   Asia   |                                 China, India, Israel, Japan, Kuwait, Malaysia, Singapore                                 |
|     40    | Oceania  |                                                        Australia                                                         |
|     50    |  Africa  |                                             Egypt, Nigeria, Zambia, Zimbabwe                                             |
+-----------+----------+--------------------------------------------------------------------------------------------------------------------------+

## Over + listagg
Req: Oracle 21c
Apply the function over all rows with the same partition key as this row

In [ ]:
%%sql
SELECT 
  country_name,
  region_id,
  LISTAGG(country_name, ', ') 
    WITHIN GROUP (ORDER BY country_name) 
    OVER (PARTITION BY region_id) 
    AS countries_in_region 
FROM countries
WHERE REGION_ID = 50

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------------+-----------+----------------------------------+
| country_name | region_id |       countries_in_region        |
+--------------+-----------+----------------------------------+
|    Egypt     |     50    | Egypt, Nigeria, Zambia, Zimbabwe |
|   Nigeria    |     50    | Egypt, Nigeria, Zambia, Zimbabwe |
|    Zambia    |     50    | Egypt, Nigeria, Zambia, Zimbabwe |
|   Zimbabwe   |     50    | Egypt, Nigeria, Zambia, Zimbabwe |
+--------------+-----------+----------------------------------+

In [7]:
%load_ext sql
%sql oracle+cx_oracle://co:oracle@srv2.lan:1521/free

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting and switching to connection 'oracle+cx_oracle://co:***@srv2.lan:1521/free'

In [17]:
%%sql
SELECT 
shipment_id,
CUSTOMER_ID,
DELIVERY_ADDRESS,
COUNT(1) OVER() total_system,
COUNT (1) OVER (PARTITION BY CUSTOMER_ID) customer_shipments,
ROUND(
  100.0 * COUNT(CASE WHEN SHIPMENT_STATUS = 'DELIVERED' THEN 1 END)
  OVER (PARTITION BY CUSTOMER_ID)
  / COUNT(*) OVER (PARTITION BY CUSTOMER_ID),
  2
) AS customer_delivery_ratio
,
-- 21c
COUNT(DISTINCT DELIVERY_ADDRESS) 
OVER (PARTITION BY CUSTOMER_ID) AS cust_distinct_addr
FROM SHIPMENTS

Running query in 'oracle+cx_oracle://co:***@srv2.lan:1521/free'

+-------------+-------------+------------------------+--------------+--------------------+-------------------------+--------------------+
| shipment_id | customer_id |    delivery_address    | total_system | customer_shipments | customer_delivery_ratio | cust_distinct_addr |
+-------------+-------------+------------------------+--------------+--------------------+-------------------------+--------------------+
|     1669    |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|     1670    |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|     241     |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|     301     |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|     274     |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|     300     |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|     273     |      1      | Boylston, MA 01505 USA |     1892     |         7          |           100           |         1          |
|      5      |      2      | Spencer, MA 01562 USA  |     1892     |         2          |           100           |         1          |
|      4      |      2      | Spencer, MA 01562 USA  |     1892     |         2          |           100           |         1          |
|     1046    |      3      | Webster, MA 01570 USA  |     1892     |         11         |           100           |         1          |
+-------------+-------------+------------------------+--------------+--------------------+-------------------------+--------------------+
Truncated to displaylimit of 10.

## First value
- be careful with last_value function

In [18]:
%%sql
SELECT 
order_id,
customer_id,
count(*) over (partition by customer_id) as count,
first_value(TO_CHAR(order_tms, 'YYYY-MM-DD') || ', id: '||order_id ) over (partition by customer_id order by order_tms desc) as newest,
first_value(TO_CHAR(order_tms, 'YYYY-MM-DD') || ', id: '||order_id )  over (partition by customer_id order by order_tms asc) as oldest,
listagg(TO_CHAR(order_tms, 'YYYY-MM-DD') || ', id: '||order_id , ' | ' ) over (partition by customer_id) as checks
FROM orders

Running query in 'oracle+cx_oracle://co:***@srv2.lan:1521/free'

+----------+-------------+-------+----------------------+---------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| order_id | customer_id | count |        newest        |        oldest       |                                                                                                         checks                                                                                                         |
+----------+-------------+-------+----------------------+---------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|   1491   |      1      |   5   | 2022-01-16, id: 1491 | 2021-04-20, id: 159 |                                                     2022-01-16, id: 1491 | 2021-12-31, id: 1390 | 2021-04-29, id: 201 | 2021-04-26, id: 182 | 2021-04-20, id: 159                                                      |
|   1390   |      1      |   5   | 2022-01-16, id: 1491 | 2021-04-20, id: 159 |                                                     2022-01-16, id: 1491 | 2021-12-31, id: 1390 | 2021-04-29, id: 201 | 2021-04-26, id: 182 | 2021-04-20, id: 159                                                      |
|   201    |      1      |   5   | 2022-01-16, id: 1491 | 2021-04-20, id: 159 |                                                     2022-01-16, id: 1491 | 2021-12-31, id: 1390 | 2021-04-29, id: 201 | 2021-04-26, id: 182 | 2021-04-20, id: 159                                                      |
|   182    |      1      |   5   | 2022-01-16, id: 1491 | 2021-04-20, id: 159 |                                                     2022-01-16, id: 1491 | 2021-12-31, id: 1390 | 2021-04-29, id: 201 | 2021-04-26, id: 182 | 2021-04-20, id: 159                                                      |
|   159    |      1      |   5   | 2022-01-16, id: 1491 | 2021-04-20, id: 159 |                                                     2022-01-16, id: 1491 | 2021-12-31, id: 1390 | 2021-04-29, id: 201 | 2021-04-26, id: 182 | 2021-04-20, id: 159                                                      |
|   765    |      2      |   2   | 2021-09-09, id: 765  |  2021-02-11, id: 5  |                                                                                        2021-09-09, id: 765 | 2021-02-11, id: 5                                                                                         |
|    5     |      2      |   2   | 2021-09-09, id: 765  |  2021-02-11, id: 5  |                                                                                        2021-09-09, id: 765 | 2021-02-11, id: 5                                                                                         |
|   1520   |      3      |   10  | 2022-01-20, id: 1520 |  2021-02-04, id: 1  | 2022-01-20, id: 1520 | 2021-09-22, id: 832 | 2021-09-09, id: 766 | 2021-08-11, id: 608 | 2021-07-27, id: 544 | 2021-05-27, id: 307 | 2021-05-24, id: 298 | 2021-03-22, id: 63 | 2021-03-01, id: 20 | 2021-02-04, id: 1 |
|   832    |      3      |   10  | 2022-01-20, id: 1520 |  2021-02-04, id: 1  | 2022-01-20, id: 1520 | 2021-09-22, id: 832 | 2021-09-09, id: 766 | 2021-08-11, id: 608 | 2021-07-27, id: 544 | 2021-05-27, id: 307 | 2021-05-24, id: 298 | 2021-03-22, id: 63 | 2021-03-01, id: 20 | 2021-02-04, id: 1 |
|   766    |      3      |   10  | 2022-01-20, id: 1520 |  2021-02-04, id: 1  | 2022-01-20, id: 1520 | 2021-09-22, id: 832 | 2021-09-09, id: 766 | 2021-08-11, id: 608 | 2021-07-27, id: 544 | 2021-05-27, id: 307 | 2021-05-24, id: 298 | 2021-03-22, id: 63 | 2021-03-01, id: 20 | 2021-02-04, id: 1 |
+----------+-------------+-------+----------------------+---------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

## Over- samples with constructor

**Over - Each employee record should include the total salary for all employees**

In [22]:
 %reload_ext sql
%sql oracle+cx_oracle://hr:oracle@srv2.lan:1521/free

Connecting and switching to connection 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

In [25]:
%%sql
WITH DATA (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'Zbigniew',2, 3,6000)
)
SELECT 
   D.*,
   SUM(D.salary) OVER () AS sum_salary
FROM 
DATA D

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+----------+--------+-----------+--------+------------+
| emp_id |   name   | dep_id | exp_level | salary | sum_salary |
+--------+----------+--------+-----------+--------+------------+
|   1    |   Anna   |   1    |     1     |  1000  |   13000    |
|   2    | Krystyna |   2    |     2     |  5000  |   13000    |
|   3    |   Jan    |   1    |     1     |  1000  |   13000    |
|   4    | Zbigniew |   2    |     3     |  6000  |   13000    |
+--------+----------+--------+-----------+--------+------------+

**Over - Each employee record should include the total salary for all employees in the same department.**

In [30]:
%%sql
WITH DATA (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
          (5, 'Paul',2, 3,8000),
           (6, 'Kumar',1, 3,7000)
)
SELECT 
   D.*,
   SUM(D.salary) OVER (partition by dep_id) AS result
FROM 
DATA D

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+----------+--------+-----------+--------+--------+
| emp_id |   name   | dep_id | exp_level | salary | result |
+--------+----------+--------+-----------+--------+--------+
|   1    |   Anna   |   1    |     1     |  1000  | 16000  |
|   3    |   Jan    |   1    |     1     |  1000  | 16000  |
|   4    |   John   |   1    |     3     |  7000  | 16000  |
|   6    |  Kumar   |   1    |     3     |  7000  | 16000  |
|   5    |   Paul   |   2    |     3     |  8000  | 13000  |
|   2    | Krystyna |   2    |     2     |  5000  | 13000  |
+--------+----------+--------+-----------+--------+--------+

**Each employee record should include the average salary of the most experienced employees within their department.**

In [47]:
%%sql
WITH DATA (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
          (5, 'Paul',2, 3,8000),
           (6, 'Kumar',1, 3,7000)
)
SELECT 
   D.*,
     CASE D.EXP_LEVEL WHEN 1 THEN 'Junior'
      WHEN 2 THEN 'Mid'
      WHEN 3 THEN 'Senior'
   ELSE NULL END AS explanation,
   AVG(d.salary) KEEP(DENSE_RANK LAST ORDER BY EXP_LEVEL) OVER (partition by dep_id) AS result
   --AVG(salary) FILTER (WHERE exp_level = 3) postgres
FROM 
DATA D

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+----------+--------+-----------+--------+-------------+--------+
| emp_id |   name   | dep_id | exp_level | salary | explanation | result |
+--------+----------+--------+-----------+--------+-------------+--------+
|   1    |   Anna   |   1    |     1     |  1000  |    Junior   |  7000  |
|   3    |   Jan    |   1    |     1     |  1000  |    Junior   |  7000  |
|   4    |   John   |   1    |     3     |  7000  |    Senior   |  7000  |
|   6    |  Kumar   |   1    |     3     |  7000  |    Senior   |  7000  |
|   5    |   Paul   |   2    |     3     |  8000  |    Senior   |  8000  |
|   2    | Krystyna |   2    |     2     |  5000  |     Mid     |  8000  |
+--------+----------+--------+-----------+--------+-------------+--------+

## Optimization Case - Subquery vs analytic function plan comparision

In [76]:
%%sql
EXPLAIN PLAN SET STATEMENT_ID = 'C1_SQ' FOR
WITH DATA (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
          (5, 'Paul',2, 3,8000),
           (6, 'Kumar',1, 3,7000)
)
SELECT 
   D.*,
    (select sum(salary) from data) as sq_over
    ,(select sum(salary) from data where dep_id = d.dep_id) as sq_over_partit
    ,(select sum(salary) from data where dep_id = d.dep_id and exp_level = d.exp_level) as sq_over_partit2
FROM 
DATA D

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

++
||
++
++

In [78]:
%%sql
EXPLAIN PLAN SET STATEMENT_ID = 'C1_OVER' FOR
WITH DATA (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
         (5, 'Paul',2, 3,8000),
         (6, 'Kumar',1, 3,7000)
)
SELECT 
   D.*,
    sum(salary) over ()
    , sum(salary) over (partition by dep_id)
    , sum(salary) over (partition by dep_id, exp_level)
FROM 
DATA D

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

++
||
++
++

In [83]:
df1 = %sql SELECT PLAN_TABLE_OUTPUT FROM TABLE(DBMS_XPLAN.DISPLAY('PLAN_TABLE', 'C1_SQ'))
df2 = %sql SELECT PLAN_TABLE_OUTPUT FROM TABLE(DBMS_XPLAN.DISPLAY('PLAN_TABLE', 'C1_OVER'))

from IPython.display import display
display(df1, df2)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+------------------------------------------------------------------------------------------------------------------------+
|                                                   plan_table_output                                                    |
+------------------------------------------------------------------------------------------------------------------------+
|                                               Plan hash value: 884601052                                               |
|                                                                                                                        |
| ---------------------------------------------------------------------------------------------------------------------- |
| | Id  | Operation                                | Name                      | Rows  | Bytes | Cost (%CPU)| Time     | |
| ---------------------------------------------------------------------------------------------------------------------- |
| |   0 | SELECT STATEMENT                         |                           |     6 |   318 |    22  (10)| 00:00:01 | |
| |   1 |  SORT AGGREGATE                          |                           |     1 |     3 |            |          | |
| |   2 |   VIEW                                   |                           |     6 |    18 |     2   (0)| 00:00:01 | |
| |   3 |    TABLE ACCESS FULL                     | SYS_TEMP_0FD9D6612_367AD8 |     6 |   348 |     2   (0)| 00:00:01 | |
| |   4 |  TEMP TABLE TRANSFORMATION               |                           |       |       |            |          | |
+------------------------------------------------------------------------------------------------------------------------+
Truncated to displaylimit of 10.

+---------------------------------------------------------------------------+
|                             plan_table_output                             |
+---------------------------------------------------------------------------+
|                        Plan hash value: 1053044315                        |
|                                                                           |
| ------------------------------------------------------------------------- |
| | Id  | Operation        | Name | Rows  | Bytes | Cost (%CPU)| Time     | |
| ------------------------------------------------------------------------- |
| |   0 | SELECT STATEMENT |      |     6 |   108 |    13   (8)| 00:00:01 | |
| |   1 |  WINDOW SORT     |      |     6 |   108 |    13   (8)| 00:00:01 | |
| |   2 |   VIEW           |      |     6 |   108 |    12   (0)| 00:00:01 | |
| |   3 |    VALUES SCAN   |      |     6 |       |    12   (0)| 00:00:01 | |
| ------------------------------------------------------------------------- |
+---------------------------------------------------------------------------+
Truncated to displaylimit of 10.

## SUM() with OVER: global, ordered, partitioned, grouped

In [ ]:
%%sql
WITH DATA (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
         (5, 'Paul',2, 3,8000),
         (6, 'Kumar',1, 3,7000)
)
SELECT 
   D.*
    , sum(salary) over () sum_all_rows
    , sum(salary) over (order by dep_id) sum_running_by_dep_id 
    , sum(salary) over (partition by dep_id) sum_by_dep
    , sum(salary) over (partition by dep_id, exp_level) sum_by_two
FROM 
DATA D

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+----------+--------+-----------+--------+----------+----------------+------------+----------------+
| emp_id |   name   | dep_id | exp_level | salary | sum_over | sum_order_step | sum_by_dep | sum_by_dep_exp |
+--------+----------+--------+-----------+--------+----------+----------------+------------+----------------+
|   1    |   Anna   |   1    |     1     |  1000  |  29000   |     16000      |   16000    |      2000      |
|   3    |   Jan    |   1    |     1     |  1000  |  29000   |     16000      |   16000    |      2000      |
|   6    |  Kumar   |   1    |     3     |  7000  |  29000   |     16000      |   16000    |     14000      |
|   4    |   John   |   1    |     3     |  7000  |  29000   |     16000      |   16000    |     14000      |
|   2    | Krystyna |   2    |     2     |  5000  |  29000   |     29000      |   13000    |      5000      |
|   5    |   Paul   |   2    |     3     |  8000  |  29000   |     29000      |   13000    |      8000      |
+--------+----------+--------+-----------+--------+----------+----------------+------------+----------------+

## Rank

In [54]:
%%sql
WITH data (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
         (5, 'Paul',2, 3,8000),
         (6, 'Kumar',1, 3,7000)
) 
SELECT 
     D.salary
    ,rank() over (order by salary) as rank
    ,dense_rank() over (order by salary) as drank
    ,row_number() over (order by salary) as row_n
    ,percent_rank() over (order by salary) as perc_rank
    ,round(cume_dist() over (order by salary),3) as cume_d
    ,ntile(2) over(order by salary) as ntle2
    ,ntile(3) over(order by salary) as ntle3
    ,ntile(4) over(order by salary) as ntle4
FROM data 
d

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+------+-------+-------+-----------+--------+-------+-------+-------+
| salary | rank | drank | row_n | perc_rank | cume_d | ntle2 | ntle3 | ntle4 |
+--------+------+-------+-------+-----------+--------+-------+-------+-------+
|  1000  |  1   |   1   |   1   |     0     | 0.333  |   1   |   1   |   1   |
|  1000  |  1   |   1   |   2   |     0     | 0.333  |   1   |   1   |   1   |
|  5000  |  3   |   2   |   3   |    0.4    |  0.5   |   1   |   2   |   2   |
|  7000  |  4   |   3   |   4   |    0.6    | 0.833  |   2   |   2   |   2   |
|  7000  |  4   |   3   |   5   |    0.6    | 0.833  |   2   |   3   |   3   |
|  8000  |  6   |   4   |   6   |     1     |   1    |   2   |   3   |   4   |
+--------+------+-------+-------+-----------+--------+-------+-------+-------+

## Top employees

In [100]:
%%sql
WITH data (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
         (5, 'Paul',2, 3,8000),
         (6, 'Kumar',1, 3,7000),
         (7, 'Janusz',1, 1,2000)
), 
   t_rank as (
   SELECT 
   d.*
   ,rank() over (partition by dep_id order by salary desc) rank
   from data d)

select *
from t_rank  t
where rank = 1

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+-------+--------+-----------+--------+------+
| emp_id |  name | dep_id | exp_level | salary | rank |
+--------+-------+--------+-----------+--------+------+
|   4    |  John |   1    |     3     |  7000  |  1   |
|   6    | Kumar |   1    |     3     |  7000  |  1   |
|   5    |  Paul |   2    |     3     |  8000  |  1   |
+--------+-------+--------+-----------+--------+------+

## DENSE_RANK() over salary: global, per department, per department and level

In [89]:
%%sql
WITH DATA (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
         (5, 'Paul',2, 3,8000),
         (6, 'Kumar',1, 3,7000),
         (7, 'Janusz',1, 1,2000)
)
SELECT 
   d.*
    , dense_rank() over (order by salary desc) sum_running_by_dep_id 
    , dense_rank() over (partition by dep_id order by salary desc) sum_by_dep
    , dense_rank() over (partition by dep_id, exp_level order by salary desc) sum_by_two
FROM 
DATA d

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+----------+--------+-----------+--------+-----------------------+------------+------------+
| emp_id |   name   | dep_id | exp_level | salary | sum_running_by_dep_id | sum_by_dep | sum_by_two |
+--------+----------+--------+-----------+--------+-----------------------+------------+------------+
|   5    |   Paul   |   2    |     3     |  8000  |           1           |     1      |     1      |
|   6    |  Kumar   |   1    |     3     |  7000  |           2           |     1      |     1      |
|   4    |   John   |   1    |     3     |  7000  |           2           |     1      |     1      |
|   2    | Krystyna |   2    |     2     |  5000  |           3           |     2      |     1      |
|   7    |  Janusz  |   1    |     1     |  2000  |           4           |     2      |     1      |
|   1    |   Anna   |   1    |     1     |  1000  |           5           |     3      |     2      |
|   3    |   Jan    |   1    |     1     |  1000  |           5           |     3      |     2      |
+--------+----------+--------+-----------+--------+-----------------------+------------+------------+

## WIDTH_BUCKET

In [95]:
%%sql
WITH DATA (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
         (5, 'Paul',2, 3,8000),
         (6, 'Kumar',1, 3,7000),
         (7, 'Janusz',1, 1,2000)
)
SELECT 
   d.*,
   WIDTH_BUCKET(salary, 2000, 8000, 4) AS salary_bucket -- 0? <2000; 5? >8000
FROM 
   DATA d

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+----------+--------+-----------+--------+---------------+
| emp_id |   name   | dep_id | exp_level | salary | salary_bucket |
+--------+----------+--------+-----------+--------+---------------+
|   1    |   Anna   |   1    |     1     |  1000  |       0       |
|   2    | Krystyna |   2    |     2     |  5000  |       3       |
|   3    |   Jan    |   1    |     1     |  1000  |       0       |
|   4    |   John   |   1    |     3     |  7000  |       4       |
|   5    |   Paul   |   2    |     3     |  8000  |       5       |
|   6    |  Kumar   |   1    |     3     |  7000  |       4       |
|   7    |  Janusz  |   1    |     1     |  2000  |       1       |
+--------+----------+--------+-----------+--------+---------------+

## Lag

In [ ]:
%%sql
WITH data (emp_id, year, month, amount) AS (
  VALUES 
  (1, 2023, 1, 1000),  (1, 2023, 2, 1100),
    (1, 2023, 3, 1050),  (1, 2023, 4, 1200),
    (1, 2023, 5, 1150),  (1, 2023, 6, 1300),
    (1, 2023, 7, 1250),  (1, 2023, 8, 1350),
    (1, 2023, 9, 1400),  (1, 2023, 10, 1450),
    (1, 2023, 11, 1500), (1, 2023, 12, 1550),
    (1, 2024, 1, 1600),  (1, 2024, 2, 1580),
    (1, 2024, 3, 1620),  (1, 2024, 4, 1650),
    (1, 2024, 5, 1700),  (1, 2024, 6, 1750),
    (1, 2024, 7, 1800),  (1, 2024, 8, 1850),
    (1, 2024, 9, 1900),  (1, 2024, 10, 1950),
    (1, 2024, 11, 2000), (1, 2024, 12, 2050)
)
select
   d.*
   ,amount - lag(amount) over (order by year,month) mm
   ,amount - lag(amount,12) over (order by year, month) yy
from data d
order by year,month
--scroll down

In [130]:
result = _
df = result.DataFrame()
df

    emp_id  year  month  amount     mm     yy
0        1  2023      1    1000    NaN    NaN
1        1  2023      2    1100  100.0    NaN
2        1  2023      3    1050  -50.0    NaN
3        1  2023      4    1200  150.0    NaN
4        1  2023      5    1150  -50.0    NaN
5        1  2023      6    1300  150.0    NaN
6        1  2023      7    1250  -50.0    NaN
7        1  2023      8    1350  100.0    NaN
8        1  2023      9    1400   50.0    NaN
9        1  2023     10    1450   50.0    NaN
10       1  2023     11    1500   50.0    NaN
11       1  2023     12    1550   50.0    NaN
12       1  2024      1    1600   50.0  600.0
13       1  2024      2    1580  -20.0  480.0
14       1  2024      3    1620   40.0  570.0
15       1  2024      4    1650   30.0  450.0
16       1  2024      5    1700   50.0  550.0
17       1  2024      6    1750   50.0  450.0
18       1  2024      7    1800   50.0  550.0
19       1  2024      8    1850   50.0  500.0
20       1  2024      9    1900   50.0  500.0
21       1  2024     10    1950   50.0  500.0
22       1  2024     11    2000   50.0  500.0
23       1  2024     12    2050   50.0  500.0

In [138]:
%%sql
WITH data (emp_id, year, month, amount) AS (
  VALUES 
  (1, 2023, 1, 1000),  (1, 2023, 2, 1100),
    (1, 2023, 3, 1050),  (1, 2023, 4, 1200),
    (1, 2023, 5, 1150),  (1, 2023, 6, 1300),
    (1, 2023, 7, 1250),  (1, 2023, 8, 1350),
    (1, 2023, 9, 1400),  (1, 2023, 10, 1450),
    (1, 2023, 11, 1500), (1, 2023, 12, 1550),
    (1, 2024, 1, 1600),  (1, 2024, 2, 1580),
    (1, 2024, 3, 1620),  (1, 2024, 4, 1650),
    (1, 2024, 5, 1700),  (1, 2024, 6, 1750),
    (1, 2024, 7, 1800),  (1, 2024, 8, 1850),
    (1, 2024, 9, 1900),  (1, 2024, 10, 1950),
    (1, 2024, 11, 2000), (1, 2024, 12, 2050)
)
select 
d.*
,sum(amount) over (order by year, month) as sum_step
from data d
order by year, month

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+------+-------+--------+----------+
| emp_id | year | month | amount | sum_step |
+--------+------+-------+--------+----------+
|   1    | 2023 |   1   |  1000  |   1000   |
|   1    | 2023 |   2   |  1100  |   2100   |
|   1    | 2023 |   3   |  1050  |   3150   |
|   1    | 2023 |   4   |  1200  |   4350   |
|   1    | 2023 |   5   |  1150  |   5500   |
|   1    | 2023 |   6   |  1300  |   6800   |
|   1    | 2023 |   7   |  1250  |   8050   |
|   1    | 2023 |   8   |  1350  |   9400   |
|   1    | 2023 |   9   |  1400  |  10800   |
|   1    | 2023 |   10  |  1450  |  12250   |
+--------+------+-------+--------+----------+
Truncated to displaylimit of 10.

## Manual window

**case 1: default (like 'range between', not 'rows')**

In [139]:
%%sql
WITH data (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
         (5, 'Paul',2, 3,8000),
         (6, 'Kumar',1, 3,7000),
         (7, 'Janusz',1, 1,2000)
)
SELECT 
d.*
,sum(salary) over (partition by dep_id order by salary) as x
FROM data d

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+----------+--------+-----------+--------+-------+
| emp_id |   name   | dep_id | exp_level | salary |   x   |
+--------+----------+--------+-----------+--------+-------+
|   1    |   Anna   |   1    |     1     |  1000  |  2000 |
|   3    |   Jan    |   1    |     1     |  1000  |  2000 |
|   7    |  Janusz  |   1    |     1     |  2000  |  4000 |
|   4    |   John   |   1    |     3     |  7000  | 18000 |
|   6    |  Kumar   |   1    |     3     |  7000  | 18000 |
|   2    | Krystyna |   2    |     2     |  5000  |  5000 |
|   5    |   Paul   |   2    |     3     |  8000  | 13000 |
+--------+----------+--------+-----------+--------+-------+

**case 1: range between unbounded preceding and current row**

In [140]:
%%sql
WITH data (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
         (5, 'Paul',2, 3,8000),
         (6, 'Kumar',1, 3,7000),
         (7, 'Janusz',1, 1,2000)
)
SELECT 
d.*
,sum(salary) over (partition by dep_id order by salary range between unbounded preceding and current row) as x
FROM data d

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+----------+--------+-----------+--------+-------+
| emp_id |   name   | dep_id | exp_level | salary |   x   |
+--------+----------+--------+-----------+--------+-------+
|   1    |   Anna   |   1    |     1     |  1000  |  2000 |
|   3    |   Jan    |   1    |     1     |  1000  |  2000 |
|   7    |  Janusz  |   1    |     1     |  2000  |  4000 |
|   4    |   John   |   1    |     3     |  7000  | 18000 |
|   6    |  Kumar   |   1    |     3     |  7000  | 18000 |
|   2    | Krystyna |   2    |     2     |  5000  |  5000 |
|   5    |   Paul   |   2    |     3     |  8000  | 13000 |
+--------+----------+--------+-----------+--------+-------+

**case 1: rows between unbounded preceding and current row**

In [142]:
%%sql
WITH data (emp_id, NAME, dep_id, exp_level, salary ) AS (
  VALUES (1, 'Anna', 1, 1,1000),
         (2, 'Krystyna', 2, 2,5000 ),
         (3, 'Jan', 1, 1, 1000),
         (4, 'John',1, 3,7000),
         (5, 'Paul',2, 3,8000),
         (6, 'Kumar',1, 3,7000),
         (7, 'Janusz',1, 1,2000)
)
SELECT 
d.*
,sum(salary) over (partition by dep_id order by salary rows between unbounded preceding and current row) as x
FROM data d

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+----------+--------+-----------+--------+-------+
| emp_id |   name   | dep_id | exp_level | salary |   x   |
+--------+----------+--------+-----------+--------+-------+
|   1    |   Anna   |   1    |     1     |  1000  |  1000 |
|   3    |   Jan    |   1    |     1     |  1000  |  2000 |
|   7    |  Janusz  |   1    |     1     |  2000  |  4000 |
|   4    |   John   |   1    |     3     |  7000  | 11000 |
|   6    |  Kumar   |   1    |     3     |  7000  | 18000 |
|   2    | Krystyna |   2    |     2     |  5000  |  5000 |
|   5    |   Paul   |   2    |     3     |  8000  | 13000 |
+--------+----------+--------+-----------+--------+-------+

In [148]:
%%sql
WITH data (emp_id, year, month, amount) AS (
  VALUES 
  (1, 2023, 1, 1000),  (1, 2023, 2, 1100),
    (1, 2023, 3, 1050),  (1, 2023, 4, 1200),
    (1, 2023, 5, 1150),  (1, 2023, 6, 1300),
    (1, 2023, 7, 1250),  (1, 2023, 8, 1350),
    (1, 2023, 9, 1400),  (1, 2023, 10, 1450),
    (1, 2023, 11, 1500), (1, 2023, 12, 1550),
    (1, 2024, 1, 1600),  (1, 2024, 2, 1580),
    (1, 2024, 3, 1620),  (1, 2024, 4, 1650),
    (1, 2024, 5, 1700),  (1, 2024, 6, 1750),
    (1, 2024, 7, 1800),  (1, 2024, 8, 1850),
    (1, 2024, 9, 1900),  (1, 2024, 10, 1950),
    (1, 2024, 11, 2000), (1, 2024, 12, 2050)
)
select 
d.*
,sum(amount) over (order by year * 100 + month rows between 1 preceding and 1 following) as sum_step
from data d
order by year, month

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+------+-------+--------+----------+
| emp_id | year | month | amount | sum_step |
+--------+------+-------+--------+----------+
|   1    | 2023 |   1   |  1000  |   2100   |
|   1    | 2023 |   2   |  1100  |   3150   |
|   1    | 2023 |   3   |  1050  |   3350   |
|   1    | 2023 |   4   |  1200  |   3400   |
|   1    | 2023 |   5   |  1150  |   3650   |
|   1    | 2023 |   6   |  1300  |   3700   |
|   1    | 2023 |   7   |  1250  |   3900   |
|   1    | 2023 |   8   |  1350  |   4000   |
|   1    | 2023 |   9   |  1400  |   4200   |
|   1    | 2023 |   10  |  1450  |   4350   |
+--------+------+-------+--------+----------+
Truncated to displaylimit of 10.

## Hierarchy

**top-down**

In [151]:
%%sql
WITH DATA (
   emp_id,
   NAME,
   dep_id,
   exp_level,
   manager_id
) AS (
  VALUES 
    (1,  'CEO Anna',       0, 5, NULL),
    (2,  'CTO Zbigniew',   1, 4, 1),
    (3,  'Mgr Krystyna',   1, 3, 2),
    (4,  'Dev Jan',        1, 1, 3),
    (5,  'Dev John',       1, 1, 3),
    (6,  'Mgr Paul',       2, 3, 2),
    (7,  'Dev Kumar',      2, 1, 6),
    (8,  'Dev Janusz',     2, 1, 6)
)
SELECT D.*
FROM DATA D
START WITH EMP_ID = 1
CONNECT BY MANAGER_ID = PRIOR EMP_ID

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+--------------+--------+-----------+------------+
| emp_id |     name     | dep_id | exp_level | manager_id |
+--------+--------------+--------+-----------+------------+
|   1    |   CEO Anna   |   0    |     5     |    None    |
|   2    | CTO Zbigniew |   1    |     4     |     1      |
|   3    | Mgr Krystyna |   1    |     3     |     2      |
|   4    |   Dev Jan    |   1    |     1     |     3      |
|   5    |   Dev John   |   1    |     1     |     3      |
|   6    |   Mgr Paul   |   2    |     3     |     2      |
|   7    |  Dev Kumar   |   2    |     1     |     6      |
|   8    |  Dev Janusz  |   2    |     1     |     6      |
+--------+--------------+--------+-----------+------------+

**Bottom-up - Issues escalation**

In [176]:
%%sql
WITH DATA (
   emp_id,
   NAME,
   dep_id,
   exp_level,
   manager_id
) AS (
  VALUES 
    (1,  'CEO Anna',       0, 5, NULL),
    (2,  'CTO Zbigniew',   1, 4, 1),
    (3,  'Mgr Krystyna',   1, 3, 2),
    (4,  'Dev Jan',        1, 1, 3),
    (5,  'Dev John',       1, 1, 3),
    (6,  'Mgr Paul',       2, 3, 2),
    (7,  'Dev Kumar',      2, 1, 6),
    (8,  'Dev Janusz',     2, 1, 6)
)
SELECT 
 D.*
 ,connect_by_root name
FROM DATA D
START WITH EMP_ID = 8
CONNECT BY PRIOR manager_id = emp_id

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+--------------+--------+-----------+------------+---------------------+
| emp_id |     name     | dep_id | exp_level | manager_id | connect_by_rootname |
+--------+--------------+--------+-----------+------------+---------------------+
|   8    |  Dev Janusz  |   2    |     1     |     6      |      Dev Janusz     |
|   6    |   Mgr Paul   |   2    |     3     |     2      |      Dev Janusz     |
|   2    | CTO Zbigniew |   1    |     4     |     1      |      Dev Janusz     |
|   1    |   CEO Anna   |   0    |     5     |    None    |      Dev Janusz     |
+--------+--------------+--------+-----------+------------+---------------------+

In [172]:
%%sql
WITH DATA (
   emp_id,
   NAME,
   dep_id,
   exp_level,
   manager_id
) AS (
  VALUES 
    (1,  'CEO Anna',       0, 5, NULL),
    (2,  'CTO Zbigniew',   1, 4, 1),
    (3,  'Mgr Krystyna',   1, 3, 2),
    (4,  'Dev Jan',        1, 1, 3),
    (5,  'Dev John',       1, 1, 3),
    (6,  'Mgr Paul',       2, 3, 2),
    (7,  'Dev Kumar',      2, 1, 6),
    (8,  'Dev Janusz',     2, 1, 6)
)
SELECT 
   D.emp_id
   ,d.name
   ,'CEO ' || sys_connect_by_path(name, '->') as path
   ,level
   ,lpad(' ',5*level) || name as hierarchy
   ,connect_by_isleaf
   ,connect_by_root name as boss
FROM DATA D
START WITH manager_id = 1
CONNECT BY MANAGER_ID = PRIOR EMP_ID

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------+--------------+--------------------------------------------+-------+---------------------------+-------------------+--------------+
| emp_id |     name     |                    path                    | LEVEL |         hierarchy         | connect_by_isleaf |     boss     |
+--------+--------------+--------------------------------------------+-------+---------------------------+-------------------+--------------+
|   2    | CTO Zbigniew |             CEO ->CTO Zbigniew             |   1   |          CTO Zbigniew     |         0         | CTO Zbigniew |
|   3    | Mgr Krystyna |      CEO ->CTO Zbigniew->Mgr Krystyna      |   2   |             Mgr Krystyna  |         0         | CTO Zbigniew |
|   4    |   Dev Jan    | CEO ->CTO Zbigniew->Mgr Krystyna->Dev Jan  |   3   |                  Dev Jan  |         1         | CTO Zbigniew |
|   5    |   Dev John   | CEO ->CTO Zbigniew->Mgr Krystyna->Dev John |   3   |                 Dev John  |         1         | CTO Zbigniew |
|   6    |   Mgr Paul   |        CEO ->CTO Zbigniew->Mgr Paul        |   2   |               Mgr Paul    |         0         | CTO Zbigniew |
|   7    |  Dev Kumar   |  CEO ->CTO Zbigniew->Mgr Paul->Dev Kumar   |   3   |                 Dev Kumar |         1         | CTO Zbigniew |
|   8    |  Dev Janusz  |  CEO ->CTO Zbigniew->Mgr Paul->Dev Janusz  |   3   |                Dev Janusz |         1         | CTO Zbigniew |
+--------+--------------+--------------------------------------------+-------+---------------------------+-------------------+--------------+

In [169]:
%%sql
WITH 
DATA (ID, NAME, EATED_BY) AS ( 
   VALUES 
   (1,'DOG', NULL),
   (2,'CAT',1),
   (3,'MOUSE',2)
   ), 
FOOD_CHAIN AS (
   SELECT
   D.*
   ,'BEAR' || SYS_CONNECT_BY_PATH(NAME,' eats ') AS HIERARCHY
   ,CONNECT_BY_ISLEAF AS IS_END_OF_FOOD_CHAIN
   FROM DATA D
   START WITH EATED_BY IS NULL
   CONNECT BY PRIOR ID = EATED_BY
   )
SELECT * 
FROM FOOD_CHAIN 
WHERE IS_END_OF_FOOD_CHAIN = 1

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+----+-------+----------+-----------------------------------+----------------------+
| id |  name | eated_by |             hierarchy             | is_end_of_food_chain |
+----+-------+----------+-----------------------------------+----------------------+
| 3  | MOUSE |    2     | BEAR eats DOG eats CAT eats MOUSE |          1           |
+----+-------+----------+-----------------------------------+----------------------+